
## Plan Result (test-issue-42095_sandbox1)

[CI link](https://github.com/kyama0/aws/actions/runs/23102821747)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cloudfront.aws_cloudfront_distribution.images
  * module.cloudfront.aws_cloudfront_origin_access_control.images
  * module.cloudfront.aws_s3_bucket_policy.cloudfront
  * module.s3.aws_s3_bucket.images
  * module.s3.aws_s3_bucket_public_access_block.images


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudfront.data.aws_iam_policy_document.cloudfront_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudfront_s3" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowCloudFrontServicePrincipalReadOnly"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cloudfront.aws_cloudfront_distribution.images will be created
  + resource "aws_cloudfront_distribution" "images" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "test-issue-42095 - 画像配信用"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Name" = "test-issue-42095-images-cdn"
        }
      + tags_all                        = {
          + "Name" = "test-issue-42095-images-cdn"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "acba4595-bd28-49b8-b9fe-13317c0390fa"
          + target_origin_id         = "test-issue-42095-s3-origin"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_access_control_id    = (known after apply)
          + origin_id                   = "test-issue-42095-s3-origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.images will be created
  + resource "aws_cloudfront_origin_access_control" "images" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "test-issue-42095-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.cloudfront.aws_s3_bucket_policy.cloudfront will be created
  + resource "aws_s3_bucket_policy" "cloudfront" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-northeast-1"
    }

  # module.s3.aws_s3_bucket.images will be created
  + resource "aws_s3_bucket" "images" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "test-issue-42095-images-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "test-issue-42095-images"
        }
      + tags_all                    = {
          + "Name" = "test-issue-42095-images"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.images will be created
  + resource "aws_s3_bucket_public_access_block" "images" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-1"
      + restrict_public_buckets = true
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":256,"Program":"tfcmt","SHA1":"e145d5619cd6645259d83f24bfd318c22e195744","Target":"test-issue-42095_sandbox1","Vars":{},"WorkflowName":"Terraform Plan on PR (Projects)"} -->